package by.halaunia.main;

import by.halaunia.service.*;

import java.util.Arrays;
import java.util.Scanner;

public class Main {

    public static void main(String[] args) {
        // 1. Приветствовать любого пользователя при вводе его имени через командную строку
        //while (true) {
        //HelloUser.welcomeUser();
        //}

        //2. Отобразить в окне консоли аргументы командной строки в обратном порядке.
        //System.out.println(Arrays.toString(ReverseOrder.reverseStrArr(args)));

        //3.Вывести заданное количество случайных чисел с переходом и без перехода на новую строку
//        RandomDigits.printRandomDigits(100, false);
//        RandomDigits.printRandomDigits(100, true);

        //4. Ввести целые числа как аргументы командной строки, подсчитать их сумму (произведение) и вывести результат на консоль.
//        String result = UserDialog.receiveDataFromCommandLine();
//        Digits digits = new Digits(result.split(" "));
//        System.out.println("The result of sum is " + digits.getSum());
//        System.out.println("The result of mult is " + digits.getMult());

        //Ввести число от 1 до 12. Вывести на консоль название месяца, соответствующего данному числу.
        // Осуществить проверку корректности ввода чисел.
//        while (true) {
//            Month.treatMonthCMD();
//        }
    }
}
